# GBXMLExportOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
GBXMLExportOptions Constructor
GBXMLExportOptions Class See Also
---
Constructs a new instance of the options used to export a model in gbXML (green-building) format.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public GBXMLExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
GBXMLExportOptions()
```

# See Also
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace